Revit 2024 API
RenderNodeAction Enumeration
 Enumerated actions for processing a render node during custom export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public enum RenderNodeAction
Visual Basic
Public Enumeration RenderNodeAction
Visual C++
public enum class RenderNodeAction
Members
Member name | Description
Proceed |  Instruct the exporter to go on with processing the node. It means the exporter will continue handling the node by processing all its child nodes, if it has any, and their geometry where it is relevant.
Skip |  Instruct the exporter to skip the node. It means the exporter will not process any child nodes (nor the geometry) of the node. The respective end-node notification will still be invoked though.
See Also
Autodesk.Revit.DB Namespace